app/controllers/label_controller.rb

  def create
    return render status: 422, json: {"error"=>"Parameters missing"} if params[:name].blank?

    label = Label.new(name: params[:name], user_id: current_user_id)

    return head :created if label.save
---
INSERT INTO `labels` (`created_at`, `name`, `updated_at`, `user_id`) VALUES ('2019-12-27 10:49:35', 'label 1', '2019-12-27 10:49:35', 6)