app/controllers/notes_controller.rb

INSERT INTO `notes` (`content`, `created_at`, `title`, `updated_at`, `user_id`) VALUES ('Hello world', '2019-12-24 13:43:50', 'abcd', '2019-12-24 13:43:50', NULL)
---
  def create
    unless has_required_write_params?
      return render status: 422, json: {"error"=>"Parameters missing"}
    end
    note = Note.new(title: params[:title], content: params[:content], user_id: current_user_id)

    return head :created if note.save

SELECT DISTINCT `notes`.id FROM `notes` LEFT OUTER JOIN `labels_notes` ON `labels_notes`.`note_id` = `notes`.`id` LEFT OUTER JOIN `labels` ON `labels`.`id` = `labels_notes`.`label_id` WHERE `notes`.`user_id` = 6 LIMIT 1
SELECT `labels`.*, `t0`.`note_id` AS ar_association_key_name FROM `labels` INNER JOIN `labels_notes` `t0` ON `labels`.`id` = `t0`.`label_id` WHERE `t0`.`note_id` IN (36)
---
  def list
    page_size = params[:page_size].blank? ? @@DEFAULT_LIST_PAGE_SIZE : params[:page_size].to_i
    page_num = params[:page_num].blank? ? 0 : params[:page_num].to_i - 1
    #search_term = params[:search_term]
    note_list = Note.where(user_id: current_user_id)
                    .includes(:labels)
                    .limit(page_size).offset(page_num * page_size)

SELECT `notes`.* FROM `notes` WHERE `notes`.`id` = 0 LIMIT 1
UPDATE `notes` SET `title` = '\"Title 4\"', `content` = '\"content 4445\"', `updated_at` = '2019-12-26 10:25:34' WHERE `notes`.`id` = 34
---
  def save
    unless has_required_write_params?
      return render status: 422, json: {"error"=>"Parameters missing"}
    end

    begin
      note = Note.where([id:params[:id], user_id: current_user_id]).first
    rescue ActiveRecord::RecordNotFound
      return render status: 422, json:{"error"=>"Invalid note id"}
    end

    note.title = params[:title]
    note.content = params[:content]

    return head :ok if note.save

DELETE FROM `notes` WHERE `notes`.`id` = 37
SELECT `notes`.* FROM `notes` WHERE `notes`.`id` = 37 AND `notes`.`user_id` = 6 LIMIT 1
---
  def delete
    begin
      Note.where(id:params[:id], user_id: current_user_id).first!.destroy

SELECT `notes`.* FROM `notes` WHERE `notes`.`id` = 38 AND `notes`.`user_id` = 6 LIMIT 1
SELECT `labels`.* FROM `labels` WHERE `labels`.`id` = 1 LIMIT 1
INSERT INTO `labels` (`created_at`, `id`, `name`, `updated_at`, `user_id`) VALUES ('2019-12-27 13:08:19', 1, NULL, '2019-12-27 13:08:19', NULL)
---
  def add_label
    begin
      note = Note.where(id:params[:id], user_id: current_user_id).first!
      label = Label.where(id:params[:label_id]).first!
      note.labels << label

SELECT `notes`.* FROM `notes` WHERE `notes`.`id` = 38 AND `notes`.`user_id` = 6 LIMIT 1
---
  def remove_label
    note = Note.where(id:params[:id], user_id: current_user_id)
               .first!