app/controllers/user_controller.rb

SELECT password, id FROM `users` WHERE `users`.`name` = 'abishek_kumar' LIMIT 1
---
  def sign_in
    begin
      user = User.select([:password, :id]).where(name: params[:name]).first

INSERT INTO `users` (`created_at`, `name`, `password`, `updated_at`) VALUES ('2019-12-26 16:13:49', 'abishek_kumar', '12345', '2019-12-26 16:13:49')
---
  def sign_up
    new_user = User.new(name: params[:name], password: params[:password] )
    if new_user.save